/* PDQ3_fdc.c: PDQ3 simulator Floppy disk device

   Work derived from Copyright (c) 2004-2012, Robert M. Supnik
   Copyright (c) 2013 Holger Veit

   Permission is hereby granted, free of charge, to any person obtaining a
   copy of this software and associated documentation files (the "Software"),
   to deal in the Software without restriction, including without limitation
   the rights to use, copy, modify, merge, publish, distribute, sublicense,
   and/or sell copies of the Software, and to permit persons to whom the
   Software is furnished to do so, subject to the following conditions:

   The above copyright notice and this permission notice shall be included in
   all copies or substantial portions of the Software.

   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
   IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
   FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL
   ROBERT M SUPNIK BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
   IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

   Except as contained in this notice, the names of Robert M Supnik and Holger Veit 
   shall not be used in advertising or otherwise to promote the sale, use or other dealings
   in this Software without prior written authorization from Robert M Supnik and Holger Veit.


#define FDC_SEL_UNIT0    0x01 /* 1=select */

/* command register */
#define FDC_BIT_HEADLOAD 0x08
#define FDC_BIT_VERIFY   0x04
#define FDC_BIT_STEP3    0x00
#define FDC_BIT_STEP6    0x01
#define FDC_BIT_STEP10   0x02
#define FDC_BIT_STEP15   0x03
#define FDC_BIT_UPDATE   0x10
#define FDC_BIT_MULTI    0x10
#define FDC_BIT_SIDESEL  0x08  
#define FDC_BIT_SIDECMP  0x02  
#define FDC_BIT_DATAMARK 0x01
#define FDC_BIT_INTIMM   0x08
#define FDC_BIT_INTIDX   0x04
#define FDC_BIT_INTN2R   0x02
#define FDC_BIT_INTR2N   0x01

#define FDC_RESTORE      0x00
#define FDC_SEEK         0x10
#define FDC_STEP         0x20
#define FDC_STEP_U       0x30
#define FDC_STEPIN       0x40
#define FDC_STEPIN_U     0x50
#define FDC_STEPOUT      0x60
#define FDC_STEPOUT_U    0x70
#define FDC_READSEC      0x80
#define FDC_READSEC_M    0x90
#define FDC_WRITESEC     0xa0
#define FDC_WRITESEC_M   0xb0
#define FDC_READADDR     0xc4
#define FDC_READTRK      0xe4
#define FDC_WRITETRK     0xf4
#define FDC_FORCEINT     0xd0
#define FDC_IDLECMD      0xff

#define FDC_CMDMASK      0xf0

/* status register */
#define FDC_ST1_NOTREADY      0x80
#define FDC_ST1_WRTPROT       0x40
#define FDC_ST1_HEADLOAD      0x20
#define FDC_ST1_SEEKERROR     0x10
#define FDC_ST1_CRCERROR      0x08
#define FDC_ST1_TRACK0        0x04
#define FDC_ST1_IDXPULSE      0x02
#define FDC_ST1_BUSY          0x01
#define FDC_ST2_NOTREADY      FDC_ST1_NOTREADY
#define FDC_ST2_WRTPROT       FDC_ST1_WRTPROT
#define FDC_ST2_TYPEWFLT      0x20
#define FDC_ST2_RECNOTFND     0x10
#define FDC_ST2_CRCERROR      FDC_ST1_CRCERROR
#define FDC_ST2_LOSTDATA      0x04
#define FDC_ST2_DRQ           0x02
#define FDC_ST2_BUSY          FDC_ST1_BUSY

/* DMA ctrl reg */
#define DMA_CTRL_AECE         0x40
#define DMA_CTRL_HBUS         0x20
#define DMA_CTRL_IOM          0x10
#define DMA_CTRL_TCIE         0x08
#define DMA_CTRL_TOIE         0x04
#define DMA_CTRL_DIE          0x02
#define DMA_CTRL_RUN          0x01

/* DMA status reg */
#define DMA_ST_BUSY           0x80
#define DMA_ST_AECE           DMA_CTRL_AECE
#define DMA_ST_HBUS           DMA_CTRL_HBUS
#define DMA_ST_IOM            DMA_CTRL_IOM
#define DMA_ST_TCZI           0x08
#define DMA_ST_TOI            0x04
#define DMA_ST_DINT           0x02
#define DMA_ST_BOW            0x01

/* FDC unit flags */
#define UNIT_V_FDC_WLK        (UNIT_V_UF + 0) /* write locked                             */
#define UNIT_FDC_WLK          (1 << UNIT_V_FDC_WLK)
#define UNIT_V_FDC_VERBOSE    (UNIT_V_UF + 1) /* verbose mode, i.e. show error messages   */
#define UNIT_FDC_VERBOSE      (1 << UNIT_V_FDC_VERBOSE)

/* FDC timing */
#define FDC_WAIT_STEP         3000
#define FDC_WAIT_READ         8000
#define FDC_WAIT_READNEXT     800
#define FDC_WAIT_WRITE        8000
#define FDC_WAIT_WRITENEXT    800
#define FDC_WAIT_FORCEINT     100
#define FDC_WAIT_IDXPULSE     16000

uint8 reg_fdc_cmd;    /* FC30 write */
uint8 reg_fdc_status; /* FC30 read */
int8  reg_fdc_track;  /* FC31 */
int8  reg_fdc_sector; /* FC32 */
int8  reg_fdc_data;   /* FC33 */
uint8 reg_fdc_drvsel; /* only combined */

uint8 reg_dma_ctrl;   /* FC38 writeonly */
uint8 reg_dma_status; /* FC39 */
uint8 reg_dma_cntl;   /* FC3A */
uint8 reg_dma_cnth;   /* FC3B */
uint8 reg_dma_addrl;  /* FC3C */
uint8 reg_dma_addrh;  /* FC3D */
uint8 reg_dma_addre;  /* FC3E */
uint8 reg_dma_id;     /* FC3F - unusable */
uint16 _reg_dma_cnt;  /* combined reg */
uint32 _reg_dma_addr; /* combined reg */

int8 fdc_selected;    /* currently selected drive, -1=none */
uint8 fdc_intpending; /* currently executing force interrupt command, 0=none */

uint8 fdc_recbuf[1024];
uint32 fdc_recsize;

t_bool dma_isautoload;

/* externals */
extern UNIT cpu_unit;

/* forwards */
t_stat fdc_svc (UNIT *uptr);
t_stat fdc_reset (DEVICE *uptr);
t_stat fdc_attach(UNIT *uptr, CONST char *cptr);
t_stat fdc_detach(UNIT *uptr);
t_stat pdq3_diskCreate(FILE *fileref, const char *ctlr_comment);
t_stat pdq3_diskFormat(DISK_INFO *myDisk);
static void dma_reqinterrupt();

/* data structures */
typedef struct _drvdata {
  UNIT  *dr_unit;
  DISK_INFO *dr_imd;
  uint8 dr_ready;
  uint8 dr_head;
  uint8 dr_trk;
  uint8 dr_sec;
  uint8 dr_stepdir; /* 0=in, 1=out */
} DRVDATA;

DRVDATA fdc_drv[] = {
  { NULL, NULL, 0, },
  { NULL, NULL, 0, },
